tutorials/3D/simpleDarcyFoam/system/fvSolution
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  6
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      fvSolution;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

solvers
{
    "p.*"
    {
        solver           GAMG;
        smoother         GaussSeidel;
        preconditioner   DIC;
        tolerance        1e-10;
        relTol           1e-3;
    }
}


SIMPLE
{
    nNonOrthogonalCorrectors 1;

    residualControl
    {
        p               1e-8;
    }
}

relaxationFactors
{
    fields
    {
        p     1;
    }

    equations
    {
        p   1;
    }
}

cache
{
    grad(p);
}



PIMPLE
{
    nNonOrthogonalCorrectors 0;
    nOuterCorrectors 10;
    residualControl
    {
        p               1e-8;
    }
}

}


// ************************************************************************* //
